Autodesk.Navisworks.Api.SavedViewpointAnimation
An animation consisting of SavedViewpoints and SavedViewpointAnimationCuts.

Autodesk.Navisworks.Api.SavedViewpointAnimation.#ctor
Default constructor

Autodesk.Navisworks.Api.SavedViewpointAnimation.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SavedViewpointAnimation.Loops
Does the animation run on a continuous loop
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.SavedViewpointAnimation.Smoothing
Control the interpolation between frames
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only